In [1]:
import numpy as np
import pandas as pd

# Pandas and numpy - pair-up
### Discussion session

1. How will you read the following data into a pandas data frame? 
 ` ftp://aftp.cmdl.noaa.gov/products/trends/co2/co2_mm_mlo.txt`

In [2]:
# clicked on the link to download the file
df = pd.read_csv("co2_mm_mlo.txt", delim_whitespace = True, header = None, comment = "#")

In [3]:
df.head()

      0  1         2       3       4       5  6
0  1958  3  1958.208  315.71  315.71  314.62 -1
1  1958  4  1958.292  317.45  317.45  315.29 -1
2  1958  5  1958.375  317.50  317.50  314.71 -1
3  1958  6  1958.458  -99.99  317.10  314.85 -1
4  1958  7  1958.542  315.86  315.86  314.98 -1

2. How would you pick columns 0,1,3?  
`[[0, 1, 3]]`

In [4]:
df.iloc[:, [0, 1, 3]].head()

      0  1       3
0  1958  3  315.71
1  1958  4  317.45
2  1958  5  317.50
3  1958  6  -99.99
4  1958  7  315.86

3. Use a for loop to find all rows where 
Co2 (column 3) entries with the value -99.99 (these are missing values) and replace them with NaN values (try using np.nan - do you know what it is?).

In [5]:
# commented for a question below

# for i in range(len(df)):
#     if (df.iloc[i, 3] == -99.99):
#         df.iloc[i, 3] = np.NaN

4. Change names of columns to year, month, and CO2 (use colnames).

In [6]:
df.columns = ["Year", "Month", "CO2", "Average", "Interpolated", "Trend", "Num_Days"]

5. Add a column 'Day' and specifiy the day 15 for all entries.

In [7]:
df['Day'] = 15

6. Add a date column according to the 'year', 'month' and 'day' columns (options: use apply with lambda or for loop together with datetime.date (make sure to import it)).

In [8]:
df.head()

   Year  Month       CO2  Average  Interpolated   Trend  Num_Days  Day
0  1958      3  1958.208   315.71        315.71  314.62        -1   15
1  1958      4  1958.292   317.45        317.45  315.29        -1   15
2  1958      5  1958.375   317.50        317.50  314.71        -1   15
3  1958      6  1958.458   -99.99        317.10  314.85        -1   15
4  1958      7  1958.542   315.86        315.86  314.98        -1   15

In [9]:
df["Date"] = df.apply(lambda x: str(int(x["Year"])) + "/" + str(int(x["Month"])) + "/" + str(int(x["Day"])), axis = 1)

In [10]:
df.head()

,Year,Month,CO2,Average,Interpolated,Trend,Num_Days,Day,Date
0,1958,3,1958.208,315.71,315.71,314.62,-1,15,1958/3/15
1,1958,4,1958.292,317.45,317.45,315.29,-1,15,1958/4/15
2,1958,5,1958.375,317.50,317.50,314.71,-1,15,1958/5/15
3,1958,6,1958.458,-99.99,317.10,314.85,-1,15,1958/6/15
4,1958,7,1958.542,315.86,315.86,314.98,-1,15,1958/7/15

7. Drop the 'Day' column.

In [11]:
df.drop("Day", axis = 1, inplace = True)

In [12]:
df.head()

   Year  Month       CO2  Average  Interpolated   Trend  Num_Days       Date
0  1958      3  1958.208   315.71        315.71  314.62        -1  1958/3/15
1  1958      4  1958.292   317.45        317.45  315.29        -1  1958/4/15
2  1958      5  1958.375   317.50        317.50  314.71        -1  1958/5/15
3  1958      6  1958.458   -99.99        317.10  314.85        -1  1958/6/15
4  1958      7  1958.542   315.86        315.86  314.98        -1  1958/7/15

8. Use pandas groupby to print the yearly avg. of co2 per year.

In [13]:
yearly_co2 = df.groupby("Year")["CO2"].mean()

In [14]:
yearly_co2

Year
1958    1958.5833
1959    1959.5000
1960    1960.5000
1961    1961.5000
1962    1962.5000
1963    1963.5000
1964    1964.5000
1965    1965.5000
1966    1966.5000
1967    1967.5000
1968    1968.5000
1969    1969.5000
1970    1970.5000
1971    1971.5000
1972    1972.5000
1973    1973.5000
1974    1974.5000
1975    1975.5000
1976    1976.5000
1977    1977.5000
1978    1978.5000
1979    1979.5000
1980    1980.5000
1981    1981.5000
1982    1982.5000
1983    1983.5000
1984    1984.5000
1985    1985.5000
1986    1986.5000
1987    1987.5000
          ...
1990    1990.5000
1991    1991.5000
1992    1992.5000
1993    1993.5000
1994    1994.5000
1995    1995.5000
1996    1996.5000
1997    1997.5000
1998    1998.5000
1999    1999.5000
2000    2000.5000
2001    2001.5000
2002    2002.5000
2003    2003.5000
2004    2004.5000
2005    2005.5000
2006    2006.5000
2007    2007.5000
2008    2008.5000
2009    2009.5000
2010    2010.5000
2011    2011.5000
2012    2012.5000
2013    2013.5000
2014    2014.5000
2015    2015.5000
2016    2016.5000
2017    2017.5000
2018    2018.5000
2019    2019.2084
Name: CO2, Length: 62, dtype: float64

9. Pick columns that you think could be used to build a model and store them in numpy array (Answer why do we do that?).

In [15]:
cols_arr = np.array([df['Year'], df["Month"], df['CO2']])
# you can easily perform many calculations on numpy arrays (statistical computations for example)

In [16]:
cols_arr

array([[1958.   , 1958.   , 1958.   , ..., 2019.   , 2019.   , 2019.   ],
       [   3.   ,    4.   ,    5.   , ...,    3.   ,    4.   ,    5.   ],
       [1958.208, 1958.292, 1958.375, ..., 2019.208, 2019.292, 2019.375]])

10. repeat step (3) but this time using the np.where command.

In [17]:
df.head()

   Year  Month       CO2  Average  Interpolated   Trend  Num_Days       Date
0  1958      3  1958.208   315.71        315.71  314.62        -1  1958/3/15
1  1958      4  1958.292   317.45        317.45  315.29        -1  1958/4/15
2  1958      5  1958.375   317.50        317.50  314.71        -1  1958/5/15
3  1958      6  1958.458   -99.99        317.10  314.85        -1  1958/6/15
4  1958      7  1958.542   315.86        315.86  314.98        -1  1958/7/15

In [18]:
df["Average"] = np.where(df["Average"] == -99.99, np.NaN, df["Average"])

In [19]:
df.head()

   Year  Month       CO2  Average  Interpolated   Trend  Num_Days       Date
0  1958      3  1958.208   315.71        315.71  314.62        -1  1958/3/15
1  1958      4  1958.292   317.45        317.45  315.29        -1  1958/4/15
2  1958      5  1958.375   317.50        317.50  314.71        -1  1958/5/15
3  1958      6  1958.458      NaN        317.10  314.85        -1  1958/6/15
4  1958      7  1958.542   315.86        315.86  314.98        -1  1958/7/15

In [20]:
# version using lists and np.where
# df["Average"][list(np.where(df['Average'] == -99.99)[0])] = np.NaN

In [21]:
# version using just pandas
# df[df['Average'] == -99.99] = np.NaN

11. Download the notebook as .py script and run it from your terminal.

In [22]:
# Done

12. Create a branch in github repository called warm_up_draft.

In [23]:
# Done

13. Push the notebook with the name CO2 to your new branch on github.

In [24]:
# Done

To make sure things work

In [25]:
print(df.head())

   Year  Month       CO2  Average  Interpolated   Trend  Num_Days       Date
0  1958      3  1958.208   315.71        315.71  314.62        -1  1958/3/15
1  1958      4  1958.292   317.45        317.45  315.29        -1  1958/4/15
2  1958      5  1958.375   317.50        317.50  314.71        -1  1958/5/15
3  1958      6  1958.458      NaN        317.10  314.85        -1  1958/6/15
4  1958      7  1958.542   315.86        315.86  314.98        -1  1958/7/15